Table of Contents
 Class GrpcBlobStorageService.GrpcBlobStorageServiceClient
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
Client for GrpcBlobStorageService
public class GrpcBlobStorageService.GrpcBlobStorageServiceClient : ClientBase<GrpcBlobStorageService.GrpcBlobStorageServiceClient>
Inheritance
object
ClientBase
ClientBase<GrpcBlobStorageService.GrpcBlobStorageServiceClient>
GrpcBlobStorageService.GrpcBlobStorageServiceClient
Inherited Members
 ClientBase<GrpcBlobStorageService.GrpcBlobStorageServiceClient>.WithHost(string)
 ClientBase.CallInvoker
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 GrpcBlobStorageServiceClient()
Protected parameterless constructor to allow creation of test doubles.
protected GrpcBlobStorageServiceClient()
 GrpcBlobStorageServiceClient(CallInvoker)
Creates a new client for GrpcBlobStorageService that uses a custom CallInvoker.
public GrpcBlobStorageServiceClient(CallInvoker callInvoker)
Parameters
callInvoker CallInvoker
The callInvoker to use to make remote calls.
 GrpcBlobStorageServiceClient(ChannelBase)
Creates a new client for GrpcBlobStorageService
public GrpcBlobStorageServiceClient(ChannelBase channel)
Parameters
channel ChannelBase
The channel to use to make remote calls.
 GrpcBlobStorageServiceClient(ClientBaseConfiguration)
Protected constructor to allow creation of configured clients.
protected GrpcBlobStorageServiceClient(ClientBase.ClientBaseConfiguration configuration)
Parameters
configuration ClientBase.ClientBaseConfiguration
The client configuration.
Methods
 Delete(ContentRequest, CallOptions)
public virtual VoidResponse Delete(ContentRequest request, CallOptions options)
Parameters
request ContentRequest
options CallOptions
Returns
VoidResponse
 Delete(ContentRequest, Metadata, DateTime?, CancellationToken)
public virtual VoidResponse Delete(ContentRequest request, Metadata headers = null, DateTime? deadline = null, CancellationToken cancellationToken = default)
Parameters
request ContentRequest
headers Metadata
deadline DateTime?
cancellationToken CancellationToken
Returns
VoidResponse
 DeleteAsync(ContentRequest, CallOptions)
public virtual AsyncUnaryCall<VoidResponse> DeleteAsync(ContentRequest request, CallOptions options)
Parameters
request ContentRequest
options CallOptions
Returns
AsyncUnaryCall<VoidResponse>
 DeleteAsync(ContentRequest, Metadata, DateTime?, CancellationToken)
public virtual AsyncUnaryCall<VoidResponse> DeleteAsync(ContentRequest request, Metadata headers = null, DateTime? deadline = null, CancellationToken cancellationToken = default)
Parameters
request ContentRequest
headers Metadata
deadline DateTime?
cancellationToken CancellationToken
Returns
AsyncUnaryCall<VoidResponse>
 Exist(ContentRequest, CallOptions)
public virtual ExistResponse Exist(ContentRequest request, CallOptions options)
Parameters
request ContentRequest
options CallOptions
Returns
ExistResponse
 Exist(ContentRequest, Metadata, DateTime?, CancellationToken)
public virtual ExistResponse Exist(ContentRequest request, Metadata headers = null, DateTime? deadline = null, CancellationToken cancellationToken = default)
Parameters
request ContentRequest
headers Metadata
deadline DateTime?
cancellationToken CancellationToken
Returns
ExistResponse
 ExistAsync(ContentRequest, CallOptions)
public virtual AsyncUnaryCall<ExistResponse> ExistAsync(ContentRequest request, CallOptions options)
Parameters
request ContentRequest
options CallOptions
Returns
AsyncUnaryCall<ExistResponse>
 ExistAsync(ContentRequest, Metadata, DateTime?, CancellationToken)
public virtual AsyncUnaryCall<ExistResponse> ExistAsync(ContentRequest request, Metadata headers = null, DateTime? deadline = null, CancellationToken cancellationToken = default)
Parameters
request ContentRequest
headers Metadata
deadline DateTime?
cancellationToken CancellationToken
Returns
AsyncUnaryCall<ExistResponse>
 GetEntries(GetEntriesRequest, CallOptions)
public virtual GetEntriesResponse GetEntries(GetEntriesRequest request, CallOptions options)
Parameters
request GetEntriesRequest
options CallOptions
Returns
GetEntriesResponse
 GetEntries(GetEntriesRequest, Metadata, DateTime?, CancellationToken)
public virtual GetEntriesResponse GetEntries(GetEntriesRequest request, Metadata headers = null, DateTime? deadline = null, CancellationToken cancellationToken = default)
Parameters
request GetEntriesRequest
headers Metadata
deadline DateTime?
cancellationToken CancellationToken
Returns
GetEntriesResponse
 GetEntriesAsync(GetEntriesRequest, CallOptions)
public virtual AsyncUnaryCall<GetEntriesResponse> GetEntriesAsync(GetEntriesRequest request, CallOptions options)
Parameters
request GetEntriesRequest
options CallOptions
Returns
AsyncUnaryCall<GetEntriesResponse>
 GetEntriesAsync(GetEntriesRequest, Metadata, DateTime?, CancellationToken)
public virtual AsyncUnaryCall<GetEntriesResponse> GetEntriesAsync(GetEntriesRequest request, Metadata headers = null, DateTime? deadline = null, CancellationToken cancellationToken = default)
Parameters
request GetEntriesRequest
headers Metadata
deadline DateTime?
cancellationToken CancellationToken
Returns
AsyncUnaryCall<GetEntriesResponse>
 NewInstance(ClientBaseConfiguration)
Creates a new instance of client from given ClientBaseConfiguration.
protected override GrpcBlobStorageService.GrpcBlobStorageServiceClient NewInstance(ClientBase.ClientBaseConfiguration configuration)
Parameters
configuration ClientBase.ClientBaseConfiguration
Returns
GrpcBlobStorageService.GrpcBlobStorageServiceClient
 Read(ContentRequest, CallOptions)
public virtual AsyncServerStreamingCall<ContentData> Read(ContentRequest request, CallOptions options)
Parameters
request ContentRequest
options CallOptions
Returns
AsyncServerStreamingCall<ContentData>
 Read(ContentRequest, Metadata, DateTime?, CancellationToken)
public virtual AsyncServerStreamingCall<ContentData> Read(ContentRequest request, Metadata headers = null, DateTime? deadline = null, CancellationToken cancellationToken = default)
Parameters
request ContentRequest
headers Metadata
deadline DateTime?
cancellationToken CancellationToken
Returns
AsyncServerStreamingCall<ContentData>
 Write(CallOptions)
blobStorageId and contentId are in metadata
public virtual AsyncClientStreamingCall<ContentData, VoidResponse> Write(CallOptions options)
Parameters
options CallOptions
The options for the call.
Returns
AsyncClientStreamingCall<ContentData, VoidResponse>
The call object.
 Write(Metadata, DateTime?, CancellationToken)
blobStorageId and contentId are in metadata
public virtual AsyncClientStreamingCall<ContentData, VoidResponse> Write(Metadata headers = null, DateTime? deadline = null, CancellationToken cancellationToken = default)
Parameters
headers Metadata
The initial metadata to send with the call. This parameter is optional.
deadline DateTime?
An optional deadline for the call. The call will be cancelled if deadline is hit.
cancellationToken CancellationToken
An optional token for canceling the call.
Returns
AsyncClientStreamingCall<ContentData, VoidResponse>
The call object.
 Edit this page